# EXL_IsCellValid

## Description
Check is cell in range of Excel sheets.

```pascal
FUNCTION EXL_IsCellValid(
				sheetIndex : INTEGER;
				cellRow    : INTEGER;
				cellColumn : INTEGER) : BOOLEAN;
```

```python

def vs.EXL_IsCellValid(sheetIndex, cellRow, cellColumn):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|sheetIndex|INTEGER||
|cellRow|INTEGER||
|cellColumn|INTEGER||

## Version
Availability: from Vectorworks 2021
## Category
* Excel